## Pandas 과제

Tabular data의 경우 모델을 돌리기에 앞서서 pandas를 통한 전처리가 많이 필요합니다.

다음 과제에서는 판다스에서 가장 자주 쓰이는 함수들을 다룹니다.

구글에 올라와 있는 판다스 연습문제 200제 중 중복되는 것, 불필요하다고 생각되는 것을 제외하여 과제를 만들게 되었습니다.

넘파이 관련 문제들도 있었지만 판다스로만 과제를 구성하게 되었고, 그것들도 풀어보고 싶은 분들은 아래 출처를 남겨 놓았으니 참고하세요.

약 150개 정도로 문제 수가 많지만 기초적인 문제들이 많기 때문에 시간이 좀 걸릴 뿐 큰 어려움은 없을 거라 생각합니다.

문제를 풀다보면 부자연스러운 문제도 많이 있지만 그냥 연습 삼아 풀어보시기 바랍니다.

관련 csv파일들은 별도의 파일에 담아놓았습니다.


 발제자: DA 23기 양진성

### 출처

Author: Avi Chawla

LinkedIn: https://www.linkedin.com/in/avi-chawla/

Read my blogs here: https://medium.com/@avi_chawla

- **Pandas**

1. Pandas Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-1-d693ac55-6455-40cf-ae34-867c6a02014e/%2Fnotebook.ipynb)
2. Pandas Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-dataset-7e3b6755-5d4b-464b-9b75-9c84667ae3bd/%2Fnotebook.ipynb)

3. Pandas Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-part-2-adc5a3ee-5f61-4725-8e46-ccb07899acfc/%2Fnotebook.ipynb)

4. Pandas Notebook 4: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-after-employee-f84e02a1-fb6a-428e-af90-8dd99855749a/%2Fnotebook.ipynb) **(This Notebook)**

- **NumPy**

1. NumPy Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Numpy-part-1-9b9979f2-b708-4292-b466-3d0157564c91/%2Fnotebook.ipynb)

2. NumPy Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-2-4456411e-2ddd-426d-8027-4881080027db/%2Fnotebook.ipynb)

3. NumPy Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-3-e6587114-b580-4249-b599-540de859e603/%2Fnotebook.ipynb)

- **SQL**

1. SQL Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-1-eac9d782-a9b1-4e84-a1f9-af14080a6121/%2Fnotebook.ipynb)

2. SQL Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-2-1914b214-be03-44a1-be63-ad99e98be639/%2Fnotebook.ipynb)

# Pandas Notebook 1

In [2]:
import pandas as pd
import numpy as np

## Create a Pandas DataFrame

### 1. Create a DataFrame from a list of lists. Name the columns "col1", "col2" and "col3".

In [3]:
data_list = [[1,2,3], [4,5,6]]
df = pd.DataFrame(data_list)
print(df)

   0  1  2
0  1  2  3
1  4  5  6

### 2. Create a DataFrame from a list of lists. Name the columns "col1", "col2" and "col3". Change the data type of all columns to "int8".

In [ ]:
data_list = [[1,2,3], [4,5,6]]

df = pd.DataFrame(data_list, columns=['col1', 'col2', 'col3'])
print(df)
print(df.dtypes)

   col1  col2  col3
0     1     2     3
1     4     5     6
col1    int8
col2    int8
col3    int8
dtype: object

### 3. Create a DataFrame from a dictionary.

In [3]:
data_dict = {'col1': [1, 2], 'col2': [3, 4]}

df = pd.DataFrame(data_dict)
print(df)

   col1  col2
0     1     3
1     2     4

### 4. Create a DataFrame from a dictionary. Change the data type to "int8".

In [ ]:
data_dict = {'col1': [1, 2], 'col2': [3, 4]}

df = pd.DataFrame(data_dict)
print(df)
print(df.dtypes)

   col1  col2
0     1     3
1     2     4
col1    int8
col2    int8
dtype: object

### 5. Create a DataFrame from a numpy array. Name the columns "col1", "col2" and "col3".

In [ ]:
data_nparray = np.array([[1,2,3], [4,5,6]])

df =  pd.DataFrame(data_nparray)
print(df)

   col1  col2  col3
0     1     2     3
1     4     5     6

## Input Operations from CSV in Pandas

### 6. Read a CSV File.

In [13]:
csv_file = 'input_data/file1.csv'
df = pd.read_csv(csv_file)
print(df)

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

### 7. Read a CSV file with delimiter "|".

In [18]:
csv_file = "input_data/file2.csv"

df = pd.read_csv(csv_file, delimiter='|')
print(df)

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

### 8. Read a CSV file with no header column and use "col1", "col2" and "col3" as column names. The delimiter is ",".

In [19]:
csv_file = "input_data/file3.csv"

df = pd.read_csv(csv_file, header=None, names=['col1', 'col2', 'col3'])
print(df)

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

### 9. There are 3 columns in the file, namely "col1", "col2", and "col3". You have to read only "col1" and "col3".

In [20]:
csv_file = "input_data/file1.csv"

df = pd.read_csv(csv_file, usecols=['col1', 'col3']) 
print(df)

   col1  col3
0     1     3
1     4     6
2     7     9

### 10. There are 3 columns in the file, namely "col1", "col2", and "col3". You have to read only "col1" and "col3". Moreover, the delimiter is "|".

In [26]:
csv_file = "input_data/file2.csv"
df =  pd.read_csv(csv_file,usecols=['col1', 'col3'], delimiter='|')
print(df)

   col1  col3
0     1     3
1     4     6
2     7     9

### 11. The file "file4.csv" has junk characters in the first two lines. You have to read the CSV file from the 3rd line.

In [27]:
csv_file = "input_data/file4.csv"
df = pd.read_csv(csv_file, skiprows=2)
print(df)

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

### 12. There are 3 columns in the file, namely "col1", "col2", and "col3". While reading the CSV file, specify the data type of "col1" as 'int32'.

In [28]:
csv_file = "input_data/file1.csv"
df =  pd.read_csv(csv_file, dtype={'col1': np.int32})
print(df)

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

### 13. The first column in the CSV file holds index values of the dataframe. Read it so that the first column goes as the index column of the dataframe.

In [32]:
csv_file = "input_data/file5.csv"
df =  pd.read_csv(csv_file, index_col=0 )
print(df)

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

### 14. There are 9 data rows in the CSV file. Read only the first 4 of them.

Note: You should NOT read the whole CSV file and use the head() method to select the first 4 rows. 🚫

In [35]:
csv_file = "input_data/file6.csv"
df = df.head(4)
print(df)

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9
3     1     2     3

## Output Operations to CSV in Pandas

### 16. Given the dataframe "df", store it to a CSV File (with the index values).

In [38]:
df = pd.DataFrame([[1,2,3], [4,5,6]],
                  columns = ["col1", "col2", "col3"])

csv_file = "output_data/file1.csv"

df.to_csv(csv_file, index=True)

### 17. Given the dataframe "df", store it to a CSV File without the index column this time.

In [39]:
df = pd.DataFrame([[1,2,3], [4,5,6]],
                  columns = ["col1", "col2", "col3"])

csv_file = "output_data/file2.csv"

## Start your code here
df.to_csv(csv_file, index=False) # index column없으려면 False
## End your code here

### 20. Given a dataframe "df" with three columns -- "col1", "col2" and "col3". Store the DataFrame to a CSV file without the column row ( and without the index values).

In [40]:
df = pd.DataFrame([[1,2,3], [4,5,6]],
                  columns = ["col1", "col2", "col3"])

csv_file = "output_data/file5.csv"


## Start your code here
df.to_csv(csv_file, index=False, header=False)
## End your code here

# Pandas Notebook 2

### 31. Read the CSV file.

In [41]:
import pandas as pd

In [42]:
file_name = "employee_dataset.csv"

df = pd.read_csv('input_data/' + file_name)

### 32. Print the first 5 rows.

In [45]:
print(df.head(5))

             Name                  Company_Name  \
0  Spencer Adkins                James and Sons
1    Julie Morton                 Nichols-James
2    Matthew Hall                     Scott Inc
3      Brad Scott  Johnston, Fleming and Tanner
4   Theresa Owens      Baker, Allen and Edwards

                        Employee_Job_Title      Employee_City  \
0                          Equities trader     New Russellton
1  Diplomatic Services operational officer  North Melissafurt
2               Regulatory affairs officer           Wardfort
3                      Production engineer     West Jamesview
4                      Production engineer          Whiteside

        Employee_Country  Employee_Salary Employment_Status  Employee_Rating
0  Palestinian Territory           321520         Full Time              3.9
1       Marshall Islands           589090         Full Time              4.3
2               Anguilla           630890         Full Time              3.1
3   Syrian Arab Republic           116400         Full Time              3.1
4               Dominica           523499         Full Time              4.8

### 33. Print the last 10 rows.

In [46]:
### 33. Print the last 10 rows.
print(df.tail(10))

                     Name                  Company_Name  \
299990      Monica Bender    Wallace, Smith and Shepard
299991  William Rodriguez                     Scott Inc
299992    Steven Thornton      Baker, Allen and Edwards
299993         Terry Hill       White, Mcclain and Cobb
299994      Kelly Bennett       White, Mcclain and Cobb
299995         Nancy Neal              Bullock-Carrillo
299996     Michele Butler  Johnston, Fleming and Tanner
299997        Lynn Wilson                 Nichols-James
299998      Lindsey Keith                 Nichols-James
299999      Karen Delgado                James and Sons

                  Employee_Job_Title      Employee_City Employee_Country  \
299990           Production engineer   New Cindychester       Bangladesh
299991                    Ergonomist          Whiteside      New Zealand
299992               Patent examiner         Aliciafort            Benin
299993  Investment banker, corporate   New Cindychester           Sweden
299994     Radiographer, therapeutic           Wardfort             Fiji
299995                   Optometrist  North Melissafurt            Samoa
299996                 Administrator         Aliciafort             Cuba
299997                 Administrator   New Cindychester          Bolivia
299998                          Make       Whitakerbury   Western Sahara
299999                       Actuary     New Russellton   United Kingdom

        Employee_Salary Employment_Status  Employee_Rating
299990           852660         Full Time              3.0
299991           214400         Full Time              1.5
299992            60240         Full Time              4.3
299993           414720            Intern              2.3
299994           182270         Full Time              3.6
299995            99670            Intern              3.3
299996           949580            Intern              2.6
299997           802830         Full Time              0.6
299998           257240         Full Time              2.4
299999           575770            Intern              3.3

### 34. Print the number of rows.

In [47]:
rows= len(df.index)

print(rows)

300000

### 35. Print the number of columns.

In [49]:
columns = len(df.columns)

print(columns)

8

### 36. Print all column names.

In [50]:
column_names = df.columns

print(column_names)

Index(['Name', 'Company_Name', 'Employee_Job_Title', 'Employee_City',
       'Employee_Country', 'Employee_Salary', 'Employment_Status',
       'Employee_Rating'],
      dtype='object')

### 37. Print the mean of Employee_Salary.

In [51]:
print(df['Employee_Salary'].mean())

500224.20772666665

### 38. Print the mean of Employee_Rating.

In [52]:
print(df['Employee_Rating'].mean())

2.5059550000000006

### 39. Print the number of distinct Company_Name.

In [55]:
print(len(df['Company_Name'].unique()))

15

### 41. Print the number of employees working in the company "Nichols-James".

In [56]:
### 41. Print the number of employees working in the company "Nichols-James".  
print(len(df[df['Company_Name'] == 'Nichols-James']))

19911

### 42-44. Print the maximum, minimum and median Employee_Salary.

In [58]:
print(df['Employee_Salary'].max())
print(df['Employee_Salary'].min())
print(df['Employee_Salary'].median())

999990
0
500780.0

### 45-49. Print the distribution of the following columns: (the frequency of individual entries).

1. Company_Name

In [59]:
print(df['Company_Name'].value_counts())

Company_Name
Scott Inc                         20390
White, Mcclain and Cobb           20261
Thomas-Spencer                    20142
Nelson-Li                         20132
Taylor-Ramos                      20122
Baker, Allen and Edwards          20084
Matthews Inc                      20083
Bullock-Carrillo                  20063
Andrade LLC                       19983
Campos, Reynolds and Mccormick    19927
Nichols-James                     19911
James and Sons                    19868
Marshall-Holloway                 19859
Johnston, Fleming and Tanner      19811
Wallace, Smith and Shepard        19364
Name: count, dtype: int64

2. Employee_Job_Title

In [61]:
print(df['Employee_Job_Title'].value_counts())

Employee_Job_Title
Diplomatic Services operational officer                  30137
Administrator                                            15222
Garment/textile technologist                             15183
Trading standards officer                                15155
Patent examiner                                          15085
Armed forces logistics/support/administrative officer    15050
Retail merchandiser                                      15033
Energy manager                                           15033
Actuary                                                  15030
Investment banker, corporate                             15008
Ergonomist                                               15006
Production engineer                                      15003
Equities trader                                          15000
Naval architect                                          14905
Radiographer, therapeutic                                14882
Regulatory affairs officer                               14869
Optometrist                                              14838
Sales promotion account executive                        14820
Make                                                     14741
Name: count, dtype: int64

### 50. Print the company with the most number of employees.

In [62]:
print(df['Company_Name'].value_counts().index[0])

Scott Inc

### 51. Print the number of employees in the above company.

In [66]:
print(df['Company_Name'].value_counts().values[0])

20390

### 52. Print the company with the least number of employees.

In [67]:
print(df['Company_Name'].value_counts().index[-1])

Wallace, Smith and Shepard

### 53. Print the number of employees in the above company.

In [68]:
print(df['Company_Name'].value_counts().values[-1])

19364

### 54. Print the employee details with the maximum salary

In [69]:
print(df[df['Employee_Salary'] == df['Employee_Salary'].max()])

              Name  Company_Name   Employee_Job_Title Employee_City  \
70356  Anna Lawson  Taylor-Ramos  Production engineer   Kristaburgh

      Employee_Country  Employee_Salary Employment_Status  Employee_Rating
70356          Lesotho           999990         Full Time              4.0

### 55. Print the employee details with the maximum rating

In [70]:
print(df[df['Employee_Rating']==df['Employee_Rating'].max()])

                    Name                  Company_Name  \
124       Joshua Huffman                James and Sons
342         Alan Carlson      Baker, Allen and Edwards
391         Lisa Summers  Johnston, Fleming and Tanner
395        Timothy Woods  Johnston, Fleming and Tanner
415      Cameron Hawkins                  Taylor-Ramos
...                  ...                           ...
299689    Michael Jordan  Johnston, Fleming and Tanner
299855  Rebecca Garrison                     Nelson-Li
299900      Daniel Jones                  Taylor-Ramos
299906     Justin Mendez              Bullock-Carrillo
299973      Doris Miller                   Andrade LLC

                                       Employee_Job_Title      Employee_City  \
124                          Garment/textile technologist     New Russellton
342               Diplomatic Services operational officer        Kristaburgh
391                            Regulatory affairs officer  North Melissafurt
395                          Garment/textile technologist          Whiteside
415     Armed forces logistics/support/administrative ...           Wardfort
...                                                   ...                ...
299689                                    Naval architect       Whitakerbury
299855                                Production engineer       Whitakerbury
299900                  Sales promotion account executive        Kristaburgh
299906                         Regulatory affairs officer   New Cindychester
299973  Armed forces logistics/support/administrative ...           Wardfort

                    Employee_Country  Employee_Salary Employment_Status  \
124                     Cook Islands           694760         Full Time
342                         Mongolia           491710            Intern
391                             Togo           933500         Full Time
395     United States Virgin Islands           367630         Full Time
415                         Tanzania            66570            Intern
...                              ...              ...               ...
299689                   Philippines           474540         Full Time
299855                       Ireland           592530         Full Time
299900                  Sierra Leone            32160         Full Time
299906                      Colombia           374540         Full Time
299973                    Kazakhstan           943340            Intern

        Employee_Rating
124                 5.0
342                 5.0
391                 5.0
395                 5.0
415                 5.0
...                 ...
299689              5.0
299855              5.0
299900              5.0
299906              5.0
299973              5.0

[2985 rows x 8 columns]

### 56. Print the Company_Name with most number of employees in 'Wardfort' city.

In [ ]:
print(df[df['Employee_City']=='Wardfort']['Company_Name'].value_counts().index[0])

'White, Mcclain and Cobb'

### 57. Change the Data type of 'Employee_Salary' column to float.

In [73]:
df['Employee_Salary'] = df['Employee_Salary'].astype(float)

### 58. Print the Employee_City with the most number of 'Production engineer'.

In [74]:
print(df[df['Employee_Job_Title']=='Production engineer']['Employee_City'].value_counts().index[0])

Aliciafort

### 60. Print the Company_Name with the highest average 'Employee_Rating'.

In [76]:
print(df.groupby('Company_Name')['Employee_Rating'].mean().sort_values(ascending=False).index[0])

Matthews Inc

### 61. Print the number of employees working in 'Ricardomouth' and 'Kristaburgh' location combined.

In [79]:
print(len(df[(df['Employee_City']=='Ricardomouth') | (df['Employee_City']=='Kristaburgh')]))

60256

### 62. Print the distinct Company_Name corresponding to the 5 highest paid employees in the dataset.

In [81]:
### 62. Print the distinct Company_Name corresponding to the 5 highest paid employees in the dataset.
print(df.sort_values(by='Employee_Salary', ascending=False)['Company_Name'].unique()[:5])

['Taylor-Ramos' 'Thomas-Spencer' 'White, Mcclain and Cobb'
 'Campos, Reynolds and Mccormick' 'James and Sons']

### 63. Check if there are any duplicate rows in the DataFrame.

In [83]:
print(df.duplicated())

0         False
1         False
2         False
3         False
4         False
          ...
299995    False
299996    False
299997    False
299998    False
299999    False
Length: 300000, dtype: bool

### 64. Check if any of the columns has NaN values.

In [84]:
print(df.isnull().any())

Name                  False
Company_Name          False
Employee_Job_Title    False
Employee_City         False
Employee_Country      False
Employee_Salary       False
Employment_Status     False
Employee_Rating       False
dtype: bool

### 65. Print the data type of every column in the DataFrame.

In [85]:
print(df.dtypes)

Name                   object
Company_Name           object
Employee_Job_Title     object
Employee_City          object
Employee_Country       object
Employee_Salary       float64
Employment_Status      object
Employee_Rating       float64
dtype: object

### 66. Print the Company_Name column only as a Series

In [ ]:
print(df['Company_Name'])

0                       James and Sons
1                        Nichols-James
2                            Scott Inc
3         Johnston, Fleming and Tanner
4             Baker, Allen and Edwards
                      ...
299995                Bullock-Carrillo
299996    Johnston, Fleming and Tanner
299997                   Nichols-James
299998                   Nichols-James
299999                  James and Sons
Name: Company_Name, Length: 300000, dtype: object

### 67. Print the Company_Name column only as a DataFrame

In [86]:
print(df[['Company_Name']])

                        Company_Name
0                     James and Sons
1                      Nichols-James
2                          Scott Inc
3       Johnston, Fleming and Tanner
4           Baker, Allen and Edwards
...                              ...
299995              Bullock-Carrillo
299996  Johnston, Fleming and Tanner
299997                 Nichols-James
299998                 Nichols-James
299999                James and Sons

[300000 rows x 1 columns]

### 68. Select the 'Employee_Job_Title' and 'Employee_City' column.

In [87]:
print(df[['Employee_Job_Title', 'Employee_City']])

                             Employee_Job_Title      Employee_City
0                               Equities trader     New Russellton
1       Diplomatic Services operational officer  North Melissafurt
2                    Regulatory affairs officer           Wardfort
3                           Production engineer     West Jamesview
4                           Production engineer          Whiteside
...                                         ...                ...
299995                              Optometrist  North Melissafurt
299996                            Administrator         Aliciafort
299997                            Administrator   New Cindychester
299998                                     Make       Whitakerbury
299999                                  Actuary     New Russellton

[300000 rows x 2 columns]

### 69. Print the number of employees with Employee_Rating greater than the average Employee_Rating

In [88]:
print(len(df[df['Employee_Rating'].mean() < df['Employee_Rating']]))

147548

### 74. Print the first 5 rows of the first 5 columns.

In [89]:
# first 5 rows of the first 5 columns
print(df.iloc[:5,:5])

             Name                  Company_Name  \
0  Spencer Adkins                James and Sons
1    Julie Morton                 Nichols-James
2    Matthew Hall                     Scott Inc
3      Brad Scott  Johnston, Fleming and Tanner
4   Theresa Owens      Baker, Allen and Edwards

                        Employee_Job_Title      Employee_City  \
0                          Equities trader     New Russellton
1  Diplomatic Services operational officer  North Melissafurt
2               Regulatory affairs officer           Wardfort
3                      Production engineer     West Jamesview
4                      Production engineer          Whiteside

        Employee_Country
0  Palestinian Territory
1       Marshall Islands
2               Anguilla
3   Syrian Arab Republic
4               Dominica

### 76. Print the number of employees whose first name starts with the letter 'V'.

In [92]:
print(len(df[df['Name'].str.startswith('V')]))

3683

### 77. Print the number of employees whose last name starts with the letter 'R'.

In [96]:
print(len(df[df['Name'].str.split().str[-1].str.startswith('R')]))
print(df[df['Name'].str.split().str[-1].str.startswith('R')])

20712
                     Name                Company_Name  \
17              Gail Rose              Thomas-Spencer
26        Donna Rodriguez              Thomas-Spencer
28           Kim Reynolds           Marshall-Holloway
39          Jessica Reyes              Thomas-Spencer
55            Amanda Roth                Taylor-Ramos
...                   ...                         ...
299902  Michelle Reynolds           Marshall-Holloway
299905       Sandra Riley  Wallace, Smith and Shepard
299964   Joshua Rodriguez                 Andrade LLC
299967       James Rhodes                Matthews Inc
299991  William Rodriguez                   Scott Inc

                       Employee_Job_Title      Employee_City  \
17                        Patent examiner       Whitakerbury
26      Sales promotion account executive          Whiteside
28                                Actuary     West Jamesview
39           Garment/textile technologist        Kristaburgh
55                          Administrator  North Melissafurt
...                                   ...                ...
299902                               Make           Wardfort
299905                     Energy manager          Whiteside
299964          Trading standards officer   New Cindychester
299967                Production engineer   New Cindychester
299991                         Ergonomist          Whiteside

                Employee_Country  Employee_Salary Employment_Status  \
17                       Finland         178570.0         Full Time
26                          Guam         622920.0         Full Time
28                 Faroe Islands         794450.0         Full Time
39                      Botswana         667490.0         Full Time
55                     Macedonia         437720.0         Full Time
...                          ...              ...               ...
299902               El Salvador         105680.0         Full Time
299905  Northern Mariana Islands          34760.0         Full Time
299964              Sierra Leone         118300.0         Full Time
299967                  Honduras         386610.0         Full Time
299991               New Zealand         214400.0         Full Time

        Employee_Rating
17                  1.9
26                  2.8
28                  1.4
39                  0.7
55                  0.7
...                 ...
299902              4.8
299905              2.0
299964              1.1
299967              1.4
299991              1.5

[20712 rows x 8 columns]

### 78. Select the rows 2 to 7 and the columns 3 to 7 (both included)

In [97]:
print(df.iloc[2:8, 3:8])

    Employee_City      Employee_Country  Employee_Salary Employment_Status  \
2        Wardfort              Anguilla         630890.0         Full Time
3  West Jamesview  Syrian Arab Republic         116400.0         Full Time
4       Whiteside              Dominica         523499.0         Full Time
5    Ricardomouth                  Mali         850140.0         Full Time
6        Wardfort                 Aruba         711410.0         Full Time
7     Kristaburgh        Western Sahara         777000.0         Full Time

   Employee_Rating
2              3.1
3              3.1
4              4.8
5              2.6
6              2.0
7              3.3

### 79. Select every row after the 10th row and select all columns.

In [98]:
print(df.iloc[10:,:])

                   Name                    Company_Name  \
10      Victoria Sutton         White, Mcclain and Cobb
11      Timothy Johnson        Baker, Allen and Edwards
12       Tiffany Galvan  Campos, Reynolds and Mccormick
13          David Duran                   Nichols-James
14           Julie Cook                    Matthews Inc
...                 ...                             ...
299995       Nancy Neal                Bullock-Carrillo
299996   Michele Butler    Johnston, Fleming and Tanner
299997      Lynn Wilson                   Nichols-James
299998    Lindsey Keith                   Nichols-James
299999    Karen Delgado                  James and Sons

                             Employee_Job_Title      Employee_City  \
10                              Naval architect          Whiteside
11                   Regulatory affairs officer       Ricardomouth
12      Diplomatic Services operational officer     West Jamesview
13                 Investment banker, corporate     New Russellton
14                              Equities trader     New Russellton
...                                         ...                ...
299995                              Optometrist  North Melissafurt
299996                            Administrator         Aliciafort
299997                            Administrator   New Cindychester
299998                                     Make       Whitakerbury
299999                                  Actuary     New Russellton

       Employee_Country  Employee_Salary Employment_Status  Employee_Rating
10               Poland         656260.0         Full Time              4.9
11              Georgia         503610.0         Full Time              2.9
12                Niger         786430.0            Intern              3.6
13              Georgia         910210.0         Full Time              4.9
14          Puerto Rico         328860.0         Full Time              4.8
...                 ...              ...               ...              ...
299995            Samoa          99670.0            Intern              3.3
299996             Cuba         949580.0            Intern              2.6
299997          Bolivia         802830.0         Full Time              0.6
299998   Western Sahara         257240.0         Full Time              2.4
299999   United Kingdom         575770.0            Intern              3.3

[299990 rows x 8 columns]

### 83. Print the name of the company with the maximum employees having rating > 4.

In [102]:
print(df[df['Employee_Rating'] > 4.0 ]['Company_Name'].value_counts().index[0])

Matthews Inc

### 88. Which is the most common first name in the dataframe?

In [103]:
print(df['Name'].str.split().str[0].value_counts().index[0])

Michael

### 90. What is the average name length?

In [104]:
print(df['Name'].str.len().mean())

13.1079

# Pandas Notebook 3

In [ ]:
import pandas as pd

In [106]:
df = pd.read_csv("input_data/employee_dataset.csv")

### 91. What is the ratio of total full-time employees to Interns?

In [108]:
print(len(df[df['Employment_Status']=='Full Time'])/len(df[df['Employment_Status']=='Intern']))

4.0008334722453744

### 92. Starting from the first record, print every third record in the DataFrame.

Print 1st row, then 4th, 7th, 10th, and so on...

In [111]:
### 92. Starting from the first record, print every third record in the DataFrame.
print(df.iloc[1::3,:])

                   Name              Company_Name  \
1          Julie Morton             Nichols-James
4         Theresa Owens  Baker, Allen and Edwards
7           Vicki Beard              Matthews Inc
10      Victoria Sutton   White, Mcclain and Cobb
13          David Duran             Nichols-James
...                 ...                       ...
299986      Chelsea Lee               Andrade LLC
299989   Deborah Berger            James and Sons
299992  Steven Thornton  Baker, Allen and Edwards
299995       Nancy Neal          Bullock-Carrillo
299998    Lindsey Keith             Nichols-James

                             Employee_Job_Title      Employee_City  \
1       Diplomatic Services operational officer  North Melissafurt
4                           Production engineer          Whiteside
7       Diplomatic Services operational officer        Kristaburgh
10                              Naval architect          Whiteside
13                 Investment banker, corporate     New Russellton
...                                         ...                ...
299986             Investment banker, corporate           Wardfort
299989        Sales promotion account executive   New Cindychester
299992                          Patent examiner         Aliciafort
299995                              Optometrist  North Melissafurt
299998                                     Make       Whitakerbury

        Employee_Country  Employee_Salary Employment_Status  Employee_Rating
1       Marshall Islands           589090         Full Time              4.3
4               Dominica           523499         Full Time              4.8
7         Western Sahara           777000         Full Time              3.3
10                Poland           656260         Full Time              4.9
13               Georgia           910210         Full Time              4.9
...                  ...              ...               ...              ...
299986       Switzerland            88410         Full Time              4.4
299989             Malta           285660         Full Time              3.1
299992             Benin            60240         Full Time              4.3
299995             Samoa            99670            Intern              3.3
299998    Western Sahara           257240         Full Time              2.4

[100000 rows x 8 columns]

### 93. Find the average salary for every company.

In [ ]:
print(df.groupby('Company_Name')['Employee_Salary'].mean())

Company_Name
Andrade LLC                       497237.159385
Baker, Allen and Edwards          498032.358445
Bullock-Carrillo                  499603.804865
Campos, Reynolds and Mccormick    503528.982687
James and Sons                    503581.015754
Johnston, Fleming and Tanner      500579.128010
Marshall-Holloway                 502314.169445
Matthews Inc                      501640.159488
Nelson-Li                         500569.824558
Nichols-James                     497881.232334
Scott Inc                         500491.809024
Taylor-Ramos                      498747.292516
Thomas-Spencer                    499350.850164
Wallace, Smith and Shepard        500807.608810
White, Mcclain and Cobb           499083.493806
Name: Employee_Salary, dtype: float64

### 95. Find the average salary and average rating for every company in a single line.

In [112]:
print(df.groupby('Company_Name')[['Employee_Salary', 'Employee_Rating']].mean())

                                Employee_Salary  Employee_Rating
Company_Name
Andrade LLC                       497237.159385         2.498218
Baker, Allen and Edwards          498032.358445         2.504795
Bullock-Carrillo                  499603.804865         2.502014
Campos, Reynolds and Mccormick    503528.982687         2.506288
James and Sons                    503581.015754         2.505023
Johnston, Fleming and Tanner      500579.128010         2.513159
Marshall-Holloway                 502314.169445         2.504900
Matthews Inc                      501640.159488         2.525454
Nelson-Li                         500569.824558         2.504649
Nichols-James                     497881.232334         2.488554
Scott Inc                         500491.809024         2.515993
Taylor-Ramos                      498747.292516         2.513150
Thomas-Spencer                    499350.850164         2.505114
Wallace, Smith and Shepard        500807.608810         2.497402
White, Mcclain and Cobb           499083.493806         2.504047

### 96. Find the number of unique Employee_City corresponding to every Company_Name.

In [113]:
print(df.groupby('Company_Name')['Employee_City'].nunique())

Company_Name
Andrade LLC                       10
Baker, Allen and Edwards          10
Bullock-Carrillo                  10
Campos, Reynolds and Mccormick    10
James and Sons                    10
Johnston, Fleming and Tanner      10
Marshall-Holloway                 10
Matthews Inc                      10
Nelson-Li                         10
Nichols-James                     10
Scott Inc                         10
Taylor-Ramos                      10
Thomas-Spencer                    10
Wallace, Smith and Shepard        10
White, Mcclain and Cobb           10
Name: Employee_City, dtype: int64

### 98. Print the number of full-time and intern employees for every company

In [114]:
print(df.groupby('Company_Name')['Employment_Status'].value_counts())

Company_Name                    Employment_Status
Andrade LLC                     Full Time            15964
                                Intern                4019
Baker, Allen and Edwards        Full Time            16118
                                Intern                3966
Bullock-Carrillo                Full Time            16135
                                Intern                3928
Campos, Reynolds and Mccormick  Full Time            15930
                                Intern                3997
James and Sons                  Full Time            15888
                                Intern                3980
Johnston, Fleming and Tanner    Full Time            15832
                                Intern                3979
Marshall-Holloway               Full Time            15871
                                Intern                3988
Matthews Inc                    Full Time            16082
                                Intern                4001
Nelson-Li                       Full Time            16027
                                Intern                4105
Nichols-James                   Full Time            15872
                                Intern                4039
Scott Inc                       Full Time            16396
                                Intern                3994
Taylor-Ramos                    Full Time            16086
                                Intern                4036
Thomas-Spencer                  Full Time            16037
                                Intern                4105
Wallace, Smith and Shepard      Full Time            15467
                                Intern                3897
White, Mcclain and Cobb         Full Time            16305
                                Intern                3956
Name: count, dtype: int64

### 99. Print the job title with the most employees.

In [116]:
print(df['Employee_Job_Title'].value_counts().index[0])

Diplomatic Services operational officer

### 107. Check if the substring 'Michael Edward' appears in the Name column or not.

In [117]:
print(df['Name'].str.contains('Michael Edward'))

0         False
1         False
2         False
3         False
4         False
          ...
299995    False
299996    False
299997    False
299998    False
299999    False
Name: Name, Length: 300000, dtype: bool

### 110. Print the number of records whose company name contains the substring 'LL' (case-insensitive).

In [118]:
### 110. Print the number of records whose company name contains the substring 'LL' (case-insensitive).
print(df[df['Company_Name'].str.contains('LL', case=False)])

                   Name                Company_Name  \
4         Theresa Owens    Baker, Allen and Edwards
5         Vanessa Allen                 Andrade LLC
6           Kelly Brown                 Andrade LLC
11      Timothy Johnson    Baker, Allen and Edwards
18         Carrie Woods            Bullock-Carrillo
...                 ...                         ...
299977   Anthony Hughes            Bullock-Carrillo
299986      Chelsea Lee                 Andrade LLC
299990    Monica Bender  Wallace, Smith and Shepard
299992  Steven Thornton    Baker, Allen and Edwards
299995       Nancy Neal            Bullock-Carrillo

                       Employee_Job_Title      Employee_City Employee_Country  \
4                     Production engineer          Whiteside         Dominica
5                                    Make       Ricardomouth             Mali
6                         Naval architect           Wardfort            Aruba
11             Regulatory affairs officer       Ricardomouth          Georgia
18                             Ergonomist     New Russellton            Gabon
...                                   ...                ...              ...
299977  Sales promotion account executive       Whitakerbury          Georgia
299986       Investment banker, corporate           Wardfort      Switzerland
299990                Production engineer   New Cindychester       Bangladesh
299992                    Patent examiner         Aliciafort            Benin
299995                        Optometrist  North Melissafurt            Samoa

        Employee_Salary Employment_Status  Employee_Rating
4                523499         Full Time              4.8
5                850140         Full Time              2.6
6                711410         Full Time              2.0
11               503610         Full Time              2.9
18               985290         Full Time              2.4
...                 ...               ...              ...
299977           464910         Full Time              4.1
299986            88410         Full Time              4.4
299990           852660         Full Time              3.0
299992            60240         Full Time              4.3
299995            99670            Intern              3.3

[99353 rows x 8 columns]

### 111. Select the first row corresponding to every company in the dataframe

In [119]:
print(df.groupby('Company_Name').first())

#first(), last(), nth()

                                              Name  \
Company_Name
Andrade LLC                          Vanessa Allen
Baker, Allen and Edwards             Theresa Owens
Bullock-Carrillo                      Carrie Woods
Campos, Reynolds and Mccormick     Michael Edwards
James and Sons                      Spencer Adkins
Johnston, Fleming and Tanner            Brad Scott
Marshall-Holloway                   David Phillips
Matthews Inc                           Vicki Beard
Nelson-Li                       Micheal Fitzgerald
Nichols-James                         Julie Morton
Scott Inc                             Matthew Hall
Taylor-Ramos                           Lisa French
Thomas-Spencer                           Gail Rose
Wallace, Smith and Shepard            Ronald Clark
White, Mcclain and Cobb            Victoria Sutton

                                                     Employee_Job_Title  \
Company_Name
Andrade LLC                                                        Make
Baker, Allen and Edwards                            Production engineer
Bullock-Carrillo                                             Ergonomist
Campos, Reynolds and Mccormick                               Ergonomist
James and Sons                                          Equities trader
Johnston, Fleming and Tanner                        Production engineer
Marshall-Holloway                             Radiographer, therapeutic
Matthews Inc                    Diplomatic Services operational officer
Nelson-Li                       Diplomatic Services operational officer
Nichols-James                   Diplomatic Services operational officer
Scott Inc                                    Regulatory affairs officer
Taylor-Ramos                                  Radiographer, therapeutic
Thomas-Spencer                                          Patent examiner
Wallace, Smith and Shepard                   Regulatory affairs officer
White, Mcclain and Cobb                                 Naval architect

                                    Employee_City  \
Company_Name
Andrade LLC                          Ricardomouth
Baker, Allen and Edwards                Whiteside
Bullock-Carrillo                   New Russellton
Campos, Reynolds and Mccormick   New Cindychester
James and Sons                     New Russellton
Johnston, Fleming and Tanner       West Jamesview
Marshall-Holloway                     Kristaburgh
Matthews Inc                          Kristaburgh
Nelson-Li                            Whitakerbury
Nichols-James                   North Melissafurt
Scott Inc                                Wardfort
Taylor-Ramos                       West Jamesview
Thomas-Spencer                       Whitakerbury
Wallace, Smith and Shepard      North Melissafurt
White, Mcclain and Cobb                 Whiteside

                                                Employee_Country  \
Company_Name
Andrade LLC                                                 Mali
Baker, Allen and Edwards                                Dominica
Bullock-Carrillo                                           Gabon
Campos, Reynolds and Mccormick  Lao People's Democratic Republic
James and Sons                             Palestinian Territory
Johnston, Fleming and Tanner                Syrian Arab Republic
Marshall-Holloway                         British Virgin Islands
Matthews Inc                                      Western Sahara
Nelson-Li                                            Switzerland
Nichols-James                                   Marshall Islands
Scott Inc                                               Anguilla
Taylor-Ramos                                              Kuwait
Thomas-Spencer                                           Finland
Wallace, Smith and Shepard                                 Palau
White, Mcclain and Cobb                                   Poland

                                Employee_Salary Employment_Status  \
Company_Name
Andrade LLC                              850140         Full Time
Baker, Allen and Edwards                 523499         Full Time
Bullock-Carrillo                         985290         Full Time
Campos, Reynolds and Mccormick           516950         Full Time
James and Sons                           321520         Full Time
Johnston, Fleming and Tanner             116400         Full Time
Marshall-Holloway                         58800         Full Time
Matthews Inc                             777000         Full Time
Nelson-Li                                796690         Full Time
Nichols-James                            589090         Full Time
Scott Inc                                630890         Full Time
Taylor-Ramos                             870580         Full Time
Thomas-Spencer                           178570         Full Time
Wallace, Smith and Shepard               914110         Full Time
White, Mcclain and Cobb                  656260         Full Time

                                Employee_Rating
Company_Name
Andrade LLC                                 2.6
Baker, Allen and Edwards                    4.8
Bullock-Carrillo                            2.4
Campos, Reynolds and Mccormick              2.3
James and Sons                              3.9
Johnston, Fleming and Tanner                3.1
Marshall-Holloway                           0.6
Matthews Inc                                3.3
Nelson-Li                                   4.1
Nichols-James                               4.3
Scott Inc                                   3.1
Taylor-Ramos                                1.3
Thomas-Spencer                              1.9
Wallace, Smith and Shepard                  3.2
White, Mcclain and Cobb                     4.9

### 113. Reset the index of the dataframe inplace and delete the older index values.

In [120]:
### 113. Reset the index of the dataframe inplace and delete the older index values.
df.reset_index(inplace=True, drop=True)

### 115-1) Add a new row at the bottom of the DataFrame.

In [123]:
### 115-1) Add a new row at the bottom of the DataFrame. with 300001	Chris Anders	Scott Inc	Production engineer	Wardfort	Anguilla	343930	Full Time	3.3 and print
df.loc[300000] = ['Chris Anders', 'Scott Inc', 'Production engineer', 'Wardfort', 'Anguilla', 343930, 'Full Time', 3.3]
print(df)

                  Name                  Company_Name  \
0       Spencer Adkins                James and Sons
1         Julie Morton                 Nichols-James
2         Matthew Hall                     Scott Inc
3           Brad Scott  Johnston, Fleming and Tanner
4        Theresa Owens      Baker, Allen and Edwards
...                ...                           ...
299997     Lynn Wilson                 Nichols-James
299998   Lindsey Keith                 Nichols-James
299999   Karen Delgado                James and Sons
300001    Chris Anders                     Scott Inc
300000    Chris Anders                     Scott Inc

                             Employee_Job_Title      Employee_City  \
0                               Equities trader     New Russellton
1       Diplomatic Services operational officer  North Melissafurt
2                    Regulatory affairs officer           Wardfort
3                           Production engineer     West Jamesview
4                           Production engineer          Whiteside
...                                         ...                ...
299997                            Administrator   New Cindychester
299998                                     Make       Whitakerbury
299999                                  Actuary     New Russellton
300001                      Production engineer           Wardfort
300000                      Production engineer           Wardfort

             Employee_Country  Employee_Salary Employment_Status  \
0       Palestinian Territory           321520         Full Time
1            Marshall Islands           589090         Full Time
2                    Anguilla           630890         Full Time
3        Syrian Arab Republic           116400         Full Time
4                    Dominica           523499         Full Time
...                       ...              ...               ...
299997                Bolivia           802830         Full Time
299998         Western Sahara           257240         Full Time
299999         United Kingdom           575770            Intern
300001               Anguilla           343930         Full Time
300000               Anguilla           343930         Full Time

        Employee_Rating
0                   3.9
1                   4.3
2                   3.1
3                   3.1
4                   4.8
...                 ...
299997              0.6
299998              2.4
299999              3.3
300001              3.3
300000              3.3

[300002 rows x 8 columns]

### 115-2) Delete the row that was just newly added.

In [126]:
### 115-2) Delete the row that was just newly added.
df.drop(300001, inplace=True)
print(df)

                  Name                  Company_Name  \
0       Spencer Adkins                James and Sons
1         Julie Morton                 Nichols-James
2         Matthew Hall                     Scott Inc
3           Brad Scott  Johnston, Fleming and Tanner
4        Theresa Owens      Baker, Allen and Edwards
...                ...                           ...
299996  Michele Butler  Johnston, Fleming and Tanner
299997     Lynn Wilson                 Nichols-James
299998   Lindsey Keith                 Nichols-James
299999   Karen Delgado                James and Sons
300000    Chris Anders                     Scott Inc

                             Employee_Job_Title      Employee_City  \
0                               Equities trader     New Russellton
1       Diplomatic Services operational officer  North Melissafurt
2                    Regulatory affairs officer           Wardfort
3                           Production engineer     West Jamesview
4                           Production engineer          Whiteside
...                                         ...                ...
299996                            Administrator         Aliciafort
299997                            Administrator   New Cindychester
299998                                     Make       Whitakerbury
299999                                  Actuary     New Russellton
300000                      Production engineer           Wardfort

             Employee_Country  Employee_Salary Employment_Status  \
0       Palestinian Territory           321520         Full Time
1            Marshall Islands           589090         Full Time
2                    Anguilla           630890         Full Time
3        Syrian Arab Republic           116400         Full Time
4                    Dominica           523499         Full Time
...                       ...              ...               ...
299996                   Cuba           949580            Intern
299997                Bolivia           802830         Full Time
299998         Western Sahara           257240         Full Time
299999         United Kingdom           575770            Intern
300000               Anguilla           343930         Full Time

        Employee_Rating
0                   3.9
1                   4.3
2                   3.1
3                   3.1
4                   4.8
...                 ...
299996              2.6
299997              0.6
299998              2.4
299999              3.3
300000              3.3

[300001 rows x 8 columns]

### 117. Add a new column "Employee_Rating_New" which should be as follows:

Employee_Rating_New = max(1.5, 2*Employee_Rating - 3)

In [127]:
df['Employee_Rating_New'] = df['Employee_Rating'].apply(lambda x: max(1.5, 2*x - 3))

### 118. Convert the entire DataFrame to a list of lists. Do NOT overwrite to the current dataframe object.

In [128]:
### 118. Convert the entire DataFrame to a list of lists. Do NOT overwrite to the current dataframe object.
df_list = df.values.tolist()

### 120. Rearrange the columns in the below order. Overwrite to the current DataFrame object.

In [129]:
new_order = ["Name", "Employee_Job_Title", "Company_Name",
             "Employee_City", "Employee_Country", "Employment_Status",
             "Employee_Salary", "Employee_Rating", "Employee_Rating_New"]
df_list = df[new_order].values.tolist()

### 123. Drop the 'Name' column inplace from the DataFrame.

In [208]:
df.drop('Name', axis=1, inplace=True)
print(df)

KeyError: "['Name'] not found in axis"

### 126. Rename the columns and store to a new DataFrame 'df_renamed':

1. Employee_Rating -> Rating
2. Employee_Country -> Country
3. Employee_Salary -> Salary
4. Employee_Rating_New -> Rating_New
5. Employment_Status -> Employment_type
6. Employment_City -> City

In [210]:

df_renamed = df.rename(columns={'Employee_Rating': 'Rating', 'Employee_Country': 'Country', 'Employee_Salary': 'Salary', 'Employee_Rating_New': 'Rating_New', 'Employment_Status': 'Employment_type', 'Employee_City': 'City'})

### 128. Count the number of NaN values in each column

In [212]:
### 128. Count the number of NaN values in each column
print(df.isnull().sum())

### 131.  Map every Company_Name to a unique integer value. Name the new column "Company_ID".

For instance, if the data has 5 companies, "Company A" -> 1, "Company B" -> 2, "Company C" -> 3, "Company D" -> 4, "Company E" -> 5.

In [ ]:
df['Company_ID'] = df['Company_Name'].astype('category').cat.codes+1

### 133. Print the number of rows where 'City' belongs to the following list of cities.

Use the isin() method.

In [ ]:
city_filter_list = ["New Russellton", "Whiteside", "Kristaburgh"]

row_count = len(df[df['Employee_City'].isin(city_filter_list)])
print(row_count)

90054

### 135. Print the name of the person with the 10th largest salary. If there are multiple people with the same salary, print all names.

In [ ]:
print(df.sort_values(by='Employee_Salary', ascending=False)['Name'].unique()[9])

array(['Allen Chavez', 'David Ryan', 'Elizabeth Bell', 'Megan Petersen'],
      dtype=object)

### 136. Print a cross tabulation of Company Name and Employment Type.

In [ ]:
print(pd.crosstab(df['Company_Name'], df['Employment_Status']))

Employment_Status               Full Time  Intern
Company_Name
Andrade LLC                         15964    4019
Baker, Allen and Edwards            16118    3966
Bullock-Carrillo                    16135    3928
Campos, Reynolds and Mccormick      15930    3997
James and Sons                      15888    3980
Johnston, Fleming and Tanner        15832    3979
Marshall-Holloway                   15871    3988
Matthews Inc                        16082    4001
Nelson-Li                           16027    4105
Nichols-James                       15872    4039
Scott Inc                           16396    3994
Taylor-Ramos                        16086    4036
Thomas-Spencer                      16037    4105
Wallace, Smith and Shepard          15467    3897
White, Mcclain and Cobb             16305    3956

### 143-145. Print the 25th, 50th and 75th percentile of the Salary column

In [ ]:
print(df['Employee_Salary'].quantile([0.25, 0.5, 0.75]))

25%    250000.0
50%    500780.0
75%    749710.0
Name: Employee_Salary, dtype: float64

### 147. Distribute the Salary column in 10 equal sized bins and label each bin from 1 to 10 and add a new column named "Labels"

In [ ]:
df['Labels'] = pd.qcut(df['Employee_Salary'], q=10, labels=range(1,11))

# Pandas Notebook 4

### 151. Sort DataFrame based on another list

In [ ]:
import pandas as pd

In [214]:
new_df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], columns=["col1", "col2"])

sort_list = ["C", "A", "D", "B"]

# start your code below

new_df['col1'] = df['col1'].astype('category')


# end your code here
print(new_df)

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4

### 152. Insert a column at a specific location in a DataFrame with a name, "new_column"

In [ ]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]],
                  columns=["col_A", "col_B"])

new_column = ["P", "Q", "R", "S"]
insert_position = 1 ## between col_A and col_B

## start your code below
df.insert(insert_position, 'new_column', new_column)


## end your code here

  col_A new_column  col_B
0     A          P      1
1     B          Q      2
2     C          R      3
3     D          S      4

### 154. Count the number of Non-NaN cells for each column

In [ ]:
import numpy as np

In [ ]:
df = pd.DataFrame([["A", np.NaN], [np.NaN, 2],
                   ["C", np.NaN], ["D", 4]],
                  columns=["col_A", "col_B"])

## start your code below
print(df.count())


## end your code here

col_A    3
col_B    2
dtype: int64

### 156. Reverse DataFrame row-wise

In [ ]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]],
                  columns=["col_A", "col_B"])

## start your code below
print(df[::-1])


## end our code here

  col_A  col_B
3     D      4
2     C      3
1     B      2
0     A      1

### 157. Reverse DataFrame column-wise

In [ ]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]],
                  columns=["col_A", "col_B"])

## start your code below
print(df.loc[:, ::-1])

## end your code here

   col_B col_A
0      1     A
1      2     B
2      3     C
3      4     D

### 158. Insert a row at an arbitrary position

In [ ]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]],
                  columns=["col_A", "col_B"])

insert_pos = 1
insert_row = ["P", 5]

## start your code below
df = df.iloc[:, ::-1]

## end your code here
df

  col_A  col_B
0     A      1
1     P      5
2     B      2
3     C      3
4     D      4

### 160. The cumulative sum of a column in DataFrame

In [219]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], columns=["col_A", "col_B"])

## start your code below
### 160. The cumulative sum of a column in DataFrame add it as column!! 
df['cumulatedSume'] = df['col_B'].cumsum()
## end your code here

df

  col_A  col_B  cumulatedSume
0     A      1              1
1     B      2              3
2     C      3              6
3     D      4             10

### 165. Filter n-largest values from a DataFrame

In [220]:
df = pd.DataFrame([["A", 200], ["B", 400],
                   ["C", 100], ["D", 300]],
                  columns=["col_A", "col_B"])

k = 2

## start your code below
largest_k = df.nlargest(k, 'col_B')

## end your code here

largest_k

  col_A  col_B
1     B    400
3     D    300

### 169. Delete the rows that have NaN values

In [221]:
df = pd.DataFrame([["A", np.NaN], ["B", 2],
                   ["C", np.NaN], ["D", 4]],
                  columns=["col_A", "col_B"])

## start your code below
df.dropna(inplace=True)


## end your code here

print(df)

  col_A  col_B
1     B    2.0
3     D    4.0

### 171. Fill NaN values with column mean

In [224]:
df = pd.DataFrame([["A", np.NaN], ["B", 2],
                   ["C", np.NaN], ["D", 4]],
                  columns=["col_A", "col_B"])

## start your code below
df['col_B'].fillna(df['col_B'].mean(), inplace=True)
## end your code here

print(df)

  col_A  col_B
0     A    3.0
1     B    2.0
2     C    3.0
3     D    4.0

### 173. Swap two rows of a dataframe

In [ ]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]],
                  columns=["col_A", "col_B"])

# swap second and last row
row_1, row_2 = 1, 3

## start your code below
df.iloc[[row_1, row_2]] = df.iloc[[row_2, row_1]].values



## end your code here

print(df)

  col_A  col_B
0     A      1
1     D      4
2     C      3
3     B      2

### 174. Create a column "col_D" that contains the 2nd largest value in each row

In [ ]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 2, 9],
                   [2, 9, 3],
                   [8, 5, 4]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
df['col_D'] = df.apply(lambda x: x.nlargest(2).min(), axis=1)



# end your code here

df

   col_A  col_B  col_C  col_D
0      4      1      5      4
1      5      2      9      5
2      2      9      3      3
3      8      5      4      5

### 176. Get the Group "A" of the dataframe by first grouping the dataframe and then using the group key.

In [ ]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["A", 3], ["D", 4]],
                  columns=["col_A", "col_B"])


## start your code below
group_A = df.groupby('col_A').get_group('A')



## end your code here

group_A

  col_A  col_B
0     A      1
2     A      3

### 178. Get the rows where the value of "col_A" is equal to "col_B".

In [227]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 9],
                   [2, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
### 178. Get the rows where the value of "col_A" is equal to "col_B".

df[df['col_A'] == df['col_B']]

## end your code here

   col_A  col_B  col_C
1      5      5      9

### 180. Sort the Data on col_A and col_B

col_A -> Ascending
col_B -> Descending

In [228]:
df = pd.DataFrame([[4, 1, 5],
                   [2, 5, 9],
                   [2, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
### 180. Sort the Data on col_A and col_B
df.sort_values(by=['col_A', 'col_B'])

## end your code here

   col_A  col_B  col_C
1      2      5      9
2      2      9      3
0      4      1      5
3      8      5      8

### 182. Get the mean of every column

In [229]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 9],
                   [2, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
mean = df.mean(axis=0)

## end your code here

print(mean)

col_A    4.75
col_B    5.00
col_C    6.25
dtype: float64

### 182. Get the mean of every row

In [230]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 9],
                   [2, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
mean = df.mean(axis=1)

## end your code here

print(mean)

0    3.333333
1    6.333333
2    4.666667
3    7.000000
dtype: float64

### 183. Concatentate the two DataFrames row-wise

In [233]:
df1 = pd.DataFrame([["A", 1], ["B", 2]],
                  columns=["col_A", "col_B"])

df2 = pd.DataFrame([["A", 3], ["C", 4]],
                  columns=["col_A", "col_B"])

## start your code below
new_df = pd.concat([df1, df2], axis=0)
new_df.reset_index(inplace=True, drop=True)

## end your code here

print(new_df)

  col_A  col_B
0     A      1
1     B      2
2     A      3
3     C      4

### 184. Concatentate the two DataFrames column-wise

In [234]:
df1 = pd.DataFrame([["A", 1], ["B", 2]],
                  columns=["col_A", "col_B"])

df2 = pd.DataFrame([["A", 3], ["C", 4]],
                  columns=["col_C", "col_D"])

## start your code below
new_df = pd.concat([df1, df2], axis=0)
new_df.reset_index(inplace=True, drop=True)

## end your code here

print(new_df)

  col_A  col_B col_C  col_D
0     A    1.0   NaN    NaN
1     B    2.0   NaN    NaN
2   NaN    NaN     A    3.0
3   NaN    NaN     C    4.0

### 185. Change the last two values in the last column to [2,4]

Change 3 -> 2
Change 8 -> 4

**Note: You should do this in a single line of code**

In [235]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 9],
                   [2, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
new_df = pd.concat([df, df], axis=0)

## end your code here

print(df)

   col_A  col_B  col_C
0      4      1      5
1      5      5      9
2      2      9      3
3      8      5      8

### 186. Replace all '1' with '2'

In [236]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 1],
                   [1, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
df.replace(1, 2, inplace=True)


## end your code here

print(df)

   col_A  col_B  col_C
0      4      2      5
1      5      5      2
2      2      9      3
3      8      5      8

### 187. Replace all '1' with '2' and '5' with '6' in a single line of code

In [237]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 1],
                   [1, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
df.replace([1, 5], [2, 6], inplace=True)


## end your code here

print(df)

   col_A  col_B  col_C
0      4      2      6
1      6      6      2
2      2      9      3
3      8      6      8

### 189. Convert the DataFrame to a list of lists. Don't include the header row.

In [238]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 1],
                   [1, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
df.values.tolist()

## end your code here

print(data_list)

[[4, 1, 5], [5, 5, 1], [1, 9, 3], [8, 5, 8]]

### 190. Add three new columns that show the cumulative sum of every column

In [240]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 1],
                   [1, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
df['cumsum1'] = df['col_A'].cumsum()
df['cumsum2'] = df['col_B'].cumsum()
df['cumsum3'] = df['col_C'].cumsum()
## end your code here

print(df)

   col_A  col_B  col_C  cumsum1  cumsum2  cumsum3
0      4      1      5        4        1        5
1      5      5      1        9        6        6
2      1      9      3       10       15        9
3      8      5      8       18       20       17

### 191. Print the cumulative sum of every row in a new column.

### In other words, make a column that stores the cumulative sum of the (sum of every row).

In [241]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 1],
                   [1, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
df['cumsum'] = df.sum(axis=1).cumsum()

## end your code here

print(df)

   col_A  col_B  col_C  cumsum
0      4      1      5      10
1      5      5      1      21
2      1      9      3      34
3      8      5      8      55

### 194. GroupBy col_A, then find the sum of col_B and mean of col_C

In [242]:
df = pd.DataFrame([["A", 1, 5],
                   ["B", 5, 1],
                   ["C", 9, 3],
                   ["A", 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
df.groupby('col_A').agg({'col_B': 'sum', 'col_C': 'mean'})

## end your code here

       col_B  col_C
col_A
A          6    6.5
B          5    1.0
C          9    3.0

### 195. Find the correlation between every pair of column

In [244]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 1],
                   [1, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


sum_col_B = df.groupby("col_A")["col_B"].sum()
sum_col_C = df.groupby("col_A")["col_C"].sum()

# Display the results
print(sum_col_B)
print(sum_col_C)

print(new_df)

col_A
1    9
4    1
5    5
8    5
Name: col_B, dtype: int64
col_A
1    3
4    5
5    1
8    8
Name: col_C, dtype: int64
   col_A  col_B  col_C
0      4      1      5
1      5      5      9
2      2      9      3
3      8      5      8
0      4      1      5
1      5      5      9
2      2      9      3
3      8      5      8

### 198. Merge the two dataframes using the join() method on col_A.
참고) Note that the `join()` method is similar to the `merge()` method, but it operates on the index by default and has a simplified syntax.

### 199. Perform the full outer join on the two DataFrames.

In [249]:
df1 = pd.DataFrame([["A", 1], ["B", 2]],
                  columns=["col_A", "col_B"])

df2 = pd.DataFrame([["A", 3], ["C", 4]],
                  columns=["col_A", "col_C"])

## start your code below

new_df = pd.merge(df1, df2, on='col_A', how='outer')
## end your code here

print(new_df)

  col_A  col_B  col_C
0     A    1.0    3.0
1     B    2.0    NaN
2     C    NaN    4.0

### 200. Convert the DataFrame to a dictionary.

In [250]:
df = pd.DataFrame([[4, 1, 5],
                   [5, 5, 1],
                   [1, 9, 3],
                   [8, 5, 8]],
                  columns=["col_A", "col_B", "col_C"])


## start your code below
dict_df = df.to_dict()

## end your code here

dict_df

{'col_A': {0: 4, 1: 5, 2: 1, 3: 8},
 'col_B': {0: 1, 1: 5, 2: 9, 3: 5},
 'col_C': {0: 5, 1: 1, 2: 3, 3: 8}}

### 끝.
### 고생하셨습니다.